; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	infrared3 - mode
	spectrograph2 - mode
	image0 - mode
	thermograph1 - mode
	infrared4 - mode
	Star4 - direction
	Star23 - direction
	Star25 - direction
	Star33 - direction
	GroundStation42 - direction
	Star44 - direction
	Star47 - direction
	GroundStation43 - direction
	Star32 - direction
	GroundStation9 - direction
	Star29 - direction
	GroundStation0 - direction
	Star17 - direction
	GroundStation8 - direction
	Star21 - direction
	GroundStation46 - direction
	GroundStation28 - direction
	GroundStation5 - direction
	Star15 - direction
	GroundStation11 - direction
	Star16 - direction
	GroundStation36 - direction
	Star31 - direction
	GroundStation1 - direction
	GroundStation45 - direction
	GroundStation18 - direction
	GroundStation40 - direction
	GroundStation37 - direction
	GroundStation2 - direction
	GroundStation48 - direction
	Star39 - direction
	Star14 - direction
	Star22 - direction
	Star30 - direction
	Star49 - direction
	Star12 - direction
	GroundStation6 - direction
	Star3 - direction
	GroundStation24 - direction
	GroundStation20 - direction
	GroundStation27 - direction
	Star7 - direction
	GroundStation10 - direction
	Star38 - direction
	Star35 - direction
	GroundStation34 - direction
	GroundStation41 - direction
	GroundStation26 - direction
	Star13 - direction
	Star19 - direction
	Planet50 - direction
	Phenomenon51 - direction
	Planet52 - direction
	Phenomenon53 - direction
	Planet54 - direction
	Planet55 - direction
	Phenomenon56 - direction
	Planet57 - direction
	Planet58 - direction
	Star59 - direction
	Phenomenon60 - direction
	Planet61 - direction
	Planet62 - direction
	Phenomenon63 - direction
	Phenomenon64 - direction
	Phenomenon65 - direction
	Planet66 - direction
	Planet67 - direction
	Star68 - direction
	Phenomenon69 - direction
	Phenomenon70 - direction
	Planet71 - direction
	Planet72 - direction
	Phenomenon73 - direction
	Planet74 - direction
	Star75 - direction
	Phenomenon76 - direction
	Phenomenon77 - direction
	Phenomenon78 - direction
	Phenomenon79 - direction
	Phenomenon80 - direction
	Star81 - direction
	Planet82 - direction
	Phenomenon83 - direction
	Star84 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 image0)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 Star49)
	(calibration_target instrument0 Star21)
	(calibration_target instrument0 Star13)
	(calibration_target instrument0 GroundStation11)
	(calibration_target instrument0 Star7)
	(calibration_target instrument0 GroundStation43)
	(calibration_target instrument0 Star35)
	(calibration_target instrument0 GroundStation6)
	(supports instrument1 spectrograph2)
	(supports instrument1 infrared3)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star21)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 GroundStation37)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 GroundStation41)
	(calibration_target instrument1 GroundStation24)
	(calibration_target instrument1 Star32)
	(calibration_target instrument1 GroundStation43)
	(calibration_target instrument1 GroundStation46)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 Star35)
	(supports instrument2 image0)
	(calibration_target instrument2 Star49)
	(calibration_target instrument2 GroundStation9)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon53)
	(supports instrument3 thermograph1)
	(supports instrument3 infrared3)
	(calibration_target instrument3 GroundStation26)
	(calibration_target instrument3 Star17)
	(calibration_target instrument3 Star29)
	(supports instrument4 infrared4)
	(supports instrument4 image0)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 GroundStation37)
	(calibration_target instrument4 GroundStation27)
	(calibration_target instrument4 Star17)
	(calibration_target instrument4 Star14)
	(calibration_target instrument4 GroundStation36)
	(calibration_target instrument4 GroundStation46)
	(calibration_target instrument4 GroundStation20)
	(calibration_target instrument4 GroundStation8)
	(calibration_target instrument4 GroundStation34)
	(calibration_target instrument4 GroundStation2)
	(calibration_target instrument4 Star38)
	(calibration_target instrument4 GroundStation0)
	(calibration_target instrument4 GroundStation48)
	(calibration_target instrument4 Star30)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon60)
	(supports instrument5 thermograph1)
	(supports instrument5 image0)
	(calibration_target instrument5 GroundStation36)
	(calibration_target instrument5 GroundStation45)
	(calibration_target instrument5 Star12)
	(calibration_target instrument5 GroundStation46)
	(calibration_target instrument5 Star14)
	(calibration_target instrument5 Star7)
	(calibration_target instrument5 Star21)
	(calibration_target instrument5 GroundStation8)
	(calibration_target instrument5 GroundStation18)
	(calibration_target instrument5 GroundStation5)
	(calibration_target instrument5 Star19)
	(supports instrument6 infrared4)
	(calibration_target instrument6 Star14)
	(calibration_target instrument6 GroundStation27)
	(calibration_target instrument6 Star3)
	(calibration_target instrument6 Star35)
	(calibration_target instrument6 GroundStation40)
	(calibration_target instrument6 Star16)
	(calibration_target instrument6 GroundStation6)
	(calibration_target instrument6 Star38)
	(calibration_target instrument6 GroundStation28)
	(calibration_target instrument6 Star39)
	(calibration_target instrument6 Star30)
	(calibration_target instrument6 GroundStation2)
	(calibration_target instrument6 Star7)
	(calibration_target instrument6 GroundStation24)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation8)
	(supports instrument7 infrared3)
	(supports instrument7 thermograph1)
	(supports instrument7 image0)
	(calibration_target instrument7 Star38)
	(calibration_target instrument7 GroundStation1)
	(calibration_target instrument7 Star31)
	(calibration_target instrument7 GroundStation36)
	(calibration_target instrument7 GroundStation34)
	(calibration_target instrument7 Star16)
	(calibration_target instrument7 GroundStation11)
	(calibration_target instrument7 Star15)
	(calibration_target instrument7 GroundStation5)
	(supports instrument8 image0)
	(supports instrument8 infrared4)
	(calibration_target instrument8 GroundStation18)
	(calibration_target instrument8 Star3)
	(calibration_target instrument8 Star19)
	(calibration_target instrument8 Star35)
	(calibration_target instrument8 GroundStation45)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon76)
	(supports instrument9 image0)
	(supports instrument9 infrared4)
	(supports instrument9 spectrograph2)
	(calibration_target instrument9 GroundStation2)
	(calibration_target instrument9 GroundStation37)
	(calibration_target instrument9 GroundStation40)
	(supports instrument10 thermograph1)
	(supports instrument10 spectrograph2)
	(supports instrument10 infrared3)
	(calibration_target instrument10 Star38)
	(calibration_target instrument10 GroundStation10)
	(calibration_target instrument10 Star7)
	(calibration_target instrument10 GroundStation27)
	(calibration_target instrument10 GroundStation20)
	(calibration_target instrument10 GroundStation24)
	(calibration_target instrument10 Star3)
	(calibration_target instrument10 GroundStation6)
	(calibration_target instrument10 Star12)
	(calibration_target instrument10 Star49)
	(calibration_target instrument10 Star30)
	(calibration_target instrument10 Star22)
	(calibration_target instrument10 Star14)
	(calibration_target instrument10 GroundStation34)
	(calibration_target instrument10 Star39)
	(calibration_target instrument10 GroundStation48)
	(supports instrument11 spectrograph2)
	(calibration_target instrument11 Star19)
	(calibration_target instrument11 Star13)
	(calibration_target instrument11 GroundStation26)
	(calibration_target instrument11 GroundStation41)
	(calibration_target instrument11 GroundStation34)
	(calibration_target instrument11 Star35)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star17)
)
(:goal (and
	(pointing satellite2 Planet54)
	(pointing satellite4 Planet66)
	(have_image Planet50 infrared3)
	(have_image Phenomenon51 infrared3)
	(have_image Planet52 image0)
	(have_image Phenomenon53 spectrograph2)
	(have_image Planet54 infrared3)
	(have_image Planet55 infrared3)
	(have_image Phenomenon56 thermograph1)
	(have_image Planet57 infrared3)
	(have_image Planet58 thermograph1)
	(have_image Star59 image0)
	(have_image Phenomenon60 spectrograph2)
	(have_image Planet61 image0)
	(have_image Planet62 thermograph1)
	(have_image Phenomenon63 infrared4)
	(have_image Phenomenon64 infrared3)
	(have_image Phenomenon65 image0)
	(have_image Planet66 infrared3)
	(have_image Planet67 thermograph1)
	(have_image Star68 infrared4)
	(have_image Phenomenon69 image0)
	(have_image Phenomenon70 spectrograph2)
	(have_image Planet71 image0)
	(have_image Planet72 image0)
	(have_image Phenomenon73 image0)
	(have_image Planet74 thermograph1)
	(have_image Star75 infrared4)
	(have_image Phenomenon76 thermograph1)
	(have_image Phenomenon77 infrared3)
	(have_image Phenomenon78 infrared4)
	(have_image Phenomenon79 infrared3)
	(have_image Phenomenon80 spectrograph2)
	(have_image Star81 infrared3)
	(have_image Planet82 thermograph1)
	(have_image Phenomenon83 spectrograph2)
	(have_image Star84 thermograph1)
))

)

; plan
1. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 37
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 37
3. (calibrate satellite2 instrument5 groundstation8)
   added: (calibrated instrument5)
   goals met: 0 of 37
4. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 37
5. (turn_to satellite4 phenomenon51 star17)
   deleted: (pointing satellite4 star17)
   added: (pointing satellite4 phenomenon51)
   goals met: 0 of 37
6. (turn_to satellite2 phenomenon56 groundstation8)
   deleted: (pointing satellite2 groundstation8)
   added: (pointing satellite2 phenomenon56)
   goals met: 0 of 37
7. (take_image satellite2 phenomenon56 instrument5 thermograph1)
   added: (have_image phenomenon56 thermograph1)
   goals met: 1 of 37
8. (turn_to satellite2 phenomenon65 phenomenon56)
   deleted: (pointing satellite2 phenomenon56)
   added: (pointing satellite2 phenomenon65)
   goals met: 1 of 37
9. (take_image satellite2 phenomenon65 instrument5 image0)
   added: (have_image phenomenon65 image0)
   goals met: 2 of 37
10. (turn_to satellite2 phenomenon69 phenomenon65)
   deleted: (pointing satellite2 phenomenon65)
   added: (pointing satellite2 phenomenon69)
   goals met: 2 of 37
11. (take_image satellite2 phenomenon69 instrument5 image0)
   added: (have_image phenomenon69 image0)
   goals met: 3 of 37
12. (turn_to satellite2 phenomenon73 phenomenon69)
   deleted: (pointing satellite2 phenomenon69)
   added: (pointing satellite2 phenomenon73)
   goals met: 3 of 37
13. (take_image satellite2 phenomenon73 instrument5 image0)
   added: (have_image phenomenon73 image0)
   goals met: 4 of 37
14. (turn_to satellite2 phenomenon76 phenomenon73)
   deleted: (pointing satellite2 phenomenon73)
   added: (pointing satellite2 phenomenon76)
   goals met: 4 of 37
15. (take_image satellite2 phenomenon76 instrument5 thermograph1)
   added: (have_image phenomenon76 thermograph1)
   goals met: 5 of 37
16. (turn_to satellite2 planet52 phenomenon76)
   deleted: (pointing satellite2 phenomenon76)
   added: (pointing satellite2 planet52)
   goals met: 5 of 37
17. (take_image satellite2 planet52 instrument5 image0)
   added: (have_image planet52 image0)
   goals met: 6 of 37
18. (turn_to satellite2 planet54 planet52)
   deleted: (pointing satellite2 planet52)
   added: (pointing satellite2 planet54)
   goals met: 7 of 37
19. (turn_to satellite1 phenomenon63 phenomenon60)
   deleted: (pointing satellite1 phenomenon60)
   added: (pointing satellite1 phenomenon63)
   goals met: 7 of 37
20. (turn_to satellite4 star7 phenomenon51)
   deleted: (pointing satellite4 phenomenon51)
   added: (pointing satellite4 star7)
   goals met: 7 of 37
21. (calibrate satellite4 instrument10 star7)
   added: (calibrated instrument10)
   goals met: 7 of 37
22. (turn_to satellite4 phenomenon51 star7)
   deleted: (pointing satellite4 star7)
   added: (pointing satellite4 phenomenon51)
   goals met: 7 of 37
23. (take_image satellite4 phenomenon51 instrument10 infrared3)
   added: (have_image phenomenon51 infrared3)
   goals met: 8 of 37
24. (turn_to satellite4 phenomenon53 phenomenon51)
   deleted: (pointing satellite4 phenomenon51)
   added: (pointing satellite4 phenomenon53)
   goals met: 8 of 37
25. (take_image satellite4 phenomenon53 instrument10 spectrograph2)
   added: (have_image phenomenon53 spectrograph2)
   goals met: 9 of 37
26. (turn_to satellite4 phenomenon60 phenomenon53)
   deleted: (pointing satellite4 phenomenon53)
   added: (pointing satellite4 phenomenon60)
   goals met: 9 of 37
27. (take_image satellite4 phenomenon60 instrument10 spectrograph2)
   added: (have_image phenomenon60 spectrograph2)
   goals met: 10 of 37
28. (turn_to satellite4 phenomenon64 phenomenon60)
   deleted: (pointing satellite4 phenomenon60)
   added: (pointing satellite4 phenomenon64)
   goals met: 10 of 37
29. (take_image satellite4 phenomenon64 instrument10 infrared3)
   added: (have_image phenomenon64 infrared3)
   goals met: 11 of 37
30. (turn_to satellite4 phenomenon70 phenomenon64)
   deleted: (pointing satellite4 phenomenon64)
   added: (pointing satellite4 phenomenon70)
   goals met: 11 of 37
31. (take_image satellite4 phenomenon70 instrument10 spectrograph2)
   added: (have_image phenomenon70 spectrograph2)
   goals met: 12 of 37
32. (turn_to satellite4 phenomenon77 phenomenon70)
   deleted: (pointing satellite4 phenomenon70)
   added: (pointing satellite4 phenomenon77)
   goals met: 12 of 37
33. (take_image satellite4 phenomenon77 instrument10 infrared3)
   added: (have_image phenomenon77 infrared3)
   goals met: 13 of 37
34. (turn_to satellite4 phenomenon79 phenomenon77)
   deleted: (pointing satellite4 phenomenon77)
   added: (pointing satellite4 phenomenon79)
   goals met: 13 of 37
35. (take_image satellite4 phenomenon79 instrument10 infrared3)
   added: (have_image phenomenon79 infrared3)
   goals met: 14 of 37
36. (turn_to satellite4 phenomenon80 phenomenon79)
   deleted: (pointing satellite4 phenomenon79)
   added: (pointing satellite4 phenomenon80)
   goals met: 14 of 37
37. (take_image satellite4 phenomenon80 instrument10 spectrograph2)
   added: (have_image phenomenon80 spectrograph2)
   goals met: 15 of 37
38. (turn_to satellite4 phenomenon83 phenomenon80)
   deleted: (pointing satellite4 phenomenon80)
   added: (pointing satellite4 phenomenon83)
   goals met: 15 of 37
39. (take_image satellite4 phenomenon83 instrument10 spectrograph2)
   added: (have_image phenomenon83 spectrograph2)
   goals met: 16 of 37
40. (turn_to satellite4 planet50 phenomenon83)
   deleted: (pointing satellite4 phenomenon83)
   added: (pointing satellite4 planet50)
   goals met: 16 of 37
41. (take_image satellite4 planet50 instrument10 infrared3)
   added: (have_image planet50 infrared3)
   goals met: 17 of 37
42. (turn_to satellite4 planet54 planet50)
   deleted: (pointing satellite4 planet50)
   added: (pointing satellite4 planet54)
   goals met: 17 of 37
43. (take_image satellite4 planet54 instrument10 infrared3)
   added: (have_image planet54 infrared3)
   goals met: 18 of 37
44. (turn_to satellite4 planet55 planet54)
   deleted: (pointing satellite4 planet54)
   added: (pointing satellite4 planet55)
   goals met: 18 of 37
45. (take_image satellite4 planet55 instrument10 infrared3)
   added: (have_image planet55 infrared3)
   goals met: 19 of 37
46. (turn_to satellite4 planet57 planet55)
   deleted: (pointing satellite4 planet55)
   added: (pointing satellite4 planet57)
   goals met: 19 of 37
47. (take_image satellite4 planet57 instrument10 infrared3)
   added: (have_image planet57 infrared3)
   goals met: 20 of 37
48. (turn_to satellite4 planet58 planet57)
   deleted: (pointing satellite4 planet57)
   added: (pointing satellite4 planet58)
   goals met: 20 of 37
49. (take_image satellite4 planet58 instrument10 thermograph1)
   added: (have_image planet58 thermograph1)
   goals met: 21 of 37
50. (turn_to satellite4 planet62 planet58)
   deleted: (pointing satellite4 planet58)
   added: (pointing satellite4 planet62)
   goals met: 21 of 37
51. (take_image satellite4 planet62 instrument10 thermograph1)
   added: (have_image planet62 thermograph1)
   goals met: 22 of 37
52. (turn_to satellite4 planet66 planet62)
   deleted: (pointing satellite4 planet62)
   added: (pointing satellite4 planet66)
   goals met: 23 of 37
53. (take_image satellite4 planet66 instrument10 infrared3)
   added: (have_image planet66 infrared3)
   goals met: 24 of 37
54. (turn_to satellite4 planet67 planet66)
   deleted: (pointing satellite4 planet66)
   added: (pointing satellite4 planet67)
   goals met: 23 of 37
55. (take_image satellite4 planet67 instrument10 thermograph1)
   added: (have_image planet67 thermograph1)
   goals met: 24 of 37
56. (turn_to satellite4 planet66 planet67)
   deleted: (pointing satellite4 planet67)
   added: (pointing satellite4 planet66)
   goals met: 25 of 37
57. (turn_to satellite4 planet74 planet66)
   deleted: (pointing satellite4 planet66)
   added: (pointing satellite4 planet74)
   goals met: 24 of 37
58. (take_image satellite4 planet74 instrument10 thermograph1)
   added: (have_image planet74 thermograph1)
   goals met: 25 of 37
59. (turn_to satellite4 planet66 planet74)
   deleted: (pointing satellite4 planet74)
   added: (pointing satellite4 planet66)
   goals met: 26 of 37
60. (turn_to satellite4 planet82 planet66)
   deleted: (pointing satellite4 planet66)
   added: (pointing satellite4 planet82)
   goals met: 25 of 37
61. (take_image satellite4 planet82 instrument10 thermograph1)
   added: (have_image planet82 thermograph1)
   goals met: 26 of 37
62. (turn_to satellite4 planet66 planet82)
   deleted: (pointing satellite4 planet82)
   added: (pointing satellite4 planet66)
   goals met: 27 of 37
63. (turn_to satellite4 star81 planet66)
   deleted: (pointing satellite4 planet66)
   added: (pointing satellite4 star81)
   goals met: 26 of 37
64. (take_image satellite4 star81 instrument10 infrared3)
   added: (have_image star81 infrared3)
   goals met: 27 of 37
65. (turn_to satellite4 planet66 star81)
   deleted: (pointing satellite4 star81)
   added: (pointing satellite4 planet66)
   goals met: 28 of 37
66. (turn_to satellite4 star84 planet66)
   deleted: (pointing satellite4 planet66)
   added: (pointing satellite4 star84)
   goals met: 27 of 37
67. (take_image satellite4 star84 instrument10 thermograph1)
   added: (have_image star84 thermograph1)
   goals met: 28 of 37
68. (turn_to satellite4 planet66 star84)
   deleted: (pointing satellite4 star84)
   added: (pointing satellite4 planet66)
   goals met: 29 of 37
69. (turn_to satellite2 planet61 planet54)
   deleted: (pointing satellite2 planet54)
   added: (pointing satellite2 planet61)
   goals met: 28 of 37
70. (take_image satellite2 planet61 instrument5 image0)
   added: (have_image planet61 image0)
   goals met: 29 of 37
71. (turn_to satellite2 planet54 planet61)
   deleted: (pointing satellite2 planet61)
   added: (pointing satellite2 planet54)
   goals met: 30 of 37
72. (turn_to satellite2 planet71 planet54)
   deleted: (pointing satellite2 planet54)
   added: (pointing satellite2 planet71)
   goals met: 29 of 37
73. (take_image satellite2 planet71 instrument5 image0)
   added: (have_image planet71 image0)
   goals met: 30 of 37
74. (turn_to satellite2 planet54 planet71)
   deleted: (pointing satellite2 planet71)
   added: (pointing satellite2 planet54)
   goals met: 31 of 37
75. (turn_to satellite2 planet72 planet54)
   deleted: (pointing satellite2 planet54)
   added: (pointing satellite2 planet72)
   goals met: 30 of 37
76. (take_image satellite2 planet72 instrument5 image0)
   added: (have_image planet72 image0)
   goals met: 31 of 37
77. (turn_to satellite2 planet54 planet72)
   deleted: (pointing satellite2 planet72)
   added: (pointing satellite2 planet54)
   goals met: 32 of 37
78. (turn_to satellite2 star59 planet54)
   deleted: (pointing satellite2 planet54)
   added: (pointing satellite2 star59)
   goals met: 31 of 37
79. (take_image satellite2 star59 instrument5 image0)
   added: (have_image star59 image0)
   goals met: 32 of 37
80. (turn_to satellite2 planet54 star59)
   deleted: (pointing satellite2 star59)
   added: (pointing satellite2 planet54)
   goals met: 33 of 37
81. (turn_to satellite1 star38 phenomenon63)
   deleted: (pointing satellite1 phenomenon63)
   added: (pointing satellite1 star38)
   goals met: 33 of 37
82. (calibrate satellite1 instrument4 star38)
   added: (calibrated instrument4)
   goals met: 33 of 37
83. (turn_to satellite1 phenomenon63 star38)
   deleted: (pointing satellite1 star38)
   added: (pointing satellite1 phenomenon63)
   goals met: 33 of 37
84. (take_image satellite1 phenomenon63 instrument4 infrared4)
   added: (have_image phenomenon63 infrared4)
   goals met: 34 of 37
85. (turn_to satellite1 phenomenon78 phenomenon63)
   deleted: (pointing satellite1 phenomenon63)
   added: (pointing satellite1 phenomenon78)
   goals met: 34 of 37
86. (take_image satellite1 phenomenon78 instrument4 infrared4)
   added: (have_image phenomenon78 infrared4)
   goals met: 35 of 37
87. (turn_to satellite1 star68 phenomenon78)
   deleted: (pointing satellite1 phenomenon78)
   added: (pointing satellite1 star68)
   goals met: 35 of 37
88. (take_image satellite1 star68 instrument4 infrared4)
   added: (have_image star68 infrared4)
   goals met: 36 of 37
89. (turn_to satellite1 star75 star68)
   deleted: (pointing satellite1 star68)
   added: (pointing satellite1 star75)
   goals met: 36 of 37
90. (take_image satellite1 star75 instrument4 infrared4)
   added: (have_image star75 infrared4)
   goals met: 37 of 37
